app/Http/Controllers/Vendor/LoginController.php

    public function authenticate(Request $request) {
        if (Auth::check()) {
          Session::flash('alert', 'You are already logged in as an user');
          return back();
        }

        $vendor = Vendor::where('email', $request->email)->first();
---
select * from `vendors` where `email` = 'abhikbhattacharjee66@gmail.com' limit 1