app/Http/Controllers/Vendor/ProductController.php

select * from `categories` where `status` = 1
select * from `subcategories` where `status` = 1
---
    public function create() {
    //   $data['flashints'] = FlashInterval::all();
      $data['cats'] = Category::where('status', 1)->get();
      $data['subcats'] = Subcategory::where('status', 1)->get();

select * from `subcategories` where `category_id` = '4' and `status` = 1
---
    public function getsubcats(Request $request) {
      $subcats = Subcategory::where('category_id', $request->catid)->where('status', 1)->get();

select * from `options` where `product_attribute_id` in ('1')
select * from `product_attributes` where `id` in ('1')
select count(product_attribute_id) as attrcount from `options` where `product_attribute_id` in ('1') group by `product_attribute_id`
---
    public function getattributes(Request $request) {
      $subcat = Subcategory::find($request->subcatid);
      $attrs = json_decode($subcat->attributes, true);
      if (!empty($attrs['attributes'])) {
        $options = Option::whereIn('product_attribute_id', $attrs['attributes'])->get();
        $productattrs = ProductAttribute::whereIn('id', $attrs['attributes'])->get();
        $sameattroptions = Option::groupBy('product_attribute_id')->whereIn('product_attribute_id', $attrs['attributes'])->select(DB::raw('count(product_attribute_id) as attrcount'))->get();

select * from `products` where `vendor_id` = 17 and `deleted` = 0 order by `id` desc limit 10 offset 0
select count(*) as aggregate from `products` where `vendor_id` = 17 and `deleted` = 0
---
    public function manage() {
      $data['products'] = Product::where('vendor_id', Auth::guard('vendor')->user()->id)->orderBy('id', 'DESC')->where('deleted', 0)->paginate(10);

select * from `categories` where `status` = 1
select * from `subcategories` where `category_id` = 3
---
    public function edit($id) {
      //$data['flashints'] = FlashInterval::all();
      $data['product'] = Product::find($id);
      if ($data['product']->vendor_id != Auth::guard('vendor')->user()->id) {
        return back();
      }
      $data['checkedattrs'] = json_decode($data['product']->attributes, true);
      $data['attrs'] = json_decode(Subcategory::find($data['product']->subcategory_id)->attributes, true);
      $data['cats'] = Category::where('status', 1)->get();
      $data['subcats'] = Subcategory::where('category_id', $data['product']->category_id)->get();

select * from `preview_images` where `product_id` = '10'
---
    public function getimgs($id) {
      $preimgs = PreviewImage::where('product_id', $id)->get();

update `products` set `attributes` = '{\"shoe_size\":[\"35\",\"37\"]}', `updated_at` = '2019-07-05 06:34:17' where `id` = 10
select * from `preview_images` where `product_id` = 10
---
      $in['attributes'] = json_encode($request->except('_token','cat_helper','subcat_helper','images','imgsdb','title','price','category','subcategory','product_code','description','quantity','imgs_helper','product_id', 'offer', 'offer_type', 'offer_amount'));

      $product = Product::find($request->product_id);
      $product->fill($in)->save();

      // bring all the product images of that product
      $productimgs = PreviewImage::where('product_id', $product->id)->get();