app/Http/Controllers/ProductController.php


      $data['product'] = Product::find($id);
      $data['sales'] = $data['product']->sales;
      $data['rproducts'] = Product::where('subcategory_id', $data['product']->subcategory_id)->where('deleted', 0)->inRandomOrder()->limit(10)->get();
---
select * from `products` where `subcategory_id` = 6 and `deleted` = 0 order by RAND() limit 10