app/Http/Controllers/SearchController.php

        $data['reqattrs'] = [];
      }

      $products = Product::where('subcategory_id', $subcateogry)->get();
---
select * from `products` where `subcategory_id` is null

                      })
                      ->where('deleted', 0)->paginate(12);

      $data['categories'] = Category::where('status', 1)->get();
---
select * from `categories` where `status` = 1