app/Http/Controllers/Admin/AdminController.php

select * from `products` where year(`created_at`) = '2019'
---
    public function dashboard(){
        $admin = Admin::find(Auth::guard('admin')->user()->id);
        $sales =  Product::whereYear('created_at', '=', date('Y'))->get()->groupBy(function($d) {
                  return $d->created_at->format('F');
               });