app/Http/Controllers/Admin/OptionController.php

    public function index($id) {
      $data['pa'] = ProductAttribute::find($id);
      $data['options'] = Option::where('product_attribute_id', $id)->orderBy('id', 'DESC')->paginate(10);
---
select * from `options` where `product_attribute_id` = '4' order by `id` desc limit 10 offset 0
select count(*) as aggregate from `options` where `product_attribute_id` = '4'

    public function store(Request $request) {
      $validatedRequest = $request->validate([
        'name' => 'required',
      ]);

      $option = new Option;
      $option->product_attribute_id = $request->product_attribute_id;
      $option->name = $request->name;
      $option->status = $request->status;
      $option->save();
---
insert into `options` (`product_attribute_id`, `name`, `status`, `updated_at`, `created_at`) values ('3', '35', '1', '2019-07-05 04:45:33', '2019-07-05 04:45:33')