app/Http/Controllers/Admin/SubcategoryController.php

    public function index($id) {
      $data['category'] = Category::find($id);
      $data['subcats'] = Subcategory::where('category_id', $id)->get();
---
select * from `subcategories` where `category_id` = '3'

    public function store(Request $request) {
      $validatedRequest = $request->validate([
        'name' => 'required',
      ]);

      $attributes = json_encode($request->except('_token', 'name', 'category_id'));
      $subcat = new Subcategory;
      $subcat->category_id = $request->category_id;
      $subcat->name = $request->name;
      //$subcat->attributes = $attributes;
      $subcat->save();
---
insert into `subcategories` (`category_id`, `name`, `attributes`, `updated_at`, `created_at`) values ('3', 'Shoes', '{\"attributes\":[\"3\"]}', '2019-07-05 04:52:45', '2019-07-05 04:52:45')